dependencies/hisa/examples/aerodynamicHeating/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

xMin    -0.6;
xMax    0.6;
yMin    -0.35000000000000003;
yMax    0.35000000000000003;
zMin    -0.1;
zMax    0.2;
cellsX  60;
cellsY  35;
cellsZ  15;

vertices
(
    ( $xMin  $yMin  $zMin)
    ( $xMax  $yMin  $zMin)
    ( $xMax  $yMax  $zMin)
    ( $xMin  $yMax  $zMin)
    ( $xMin  $yMin  $zMax)
    ( $xMax  $yMin  $zMax)
    ( $xMax  $yMax  $zMax)
    ( $xMin  $yMax  $zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($cellsX $cellsY $cellsZ) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
);

// ************************************************************************* //
