dependencies/hisa/examples/aerodynamicHeating/system/solid/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        name solidToFluid;
        patchInfo
        {
//            type wall;
            type mappedWall;
            sampleMode      nearestPatchFace;
            sampleRegion    fluid;
            samplePatch     fluidToSolid;
        }
        constructFrom patches;
        patches ( "patch_1_.*" );
    }

    {
        name symmetry001;
        patchInfo
        {
            type empty;
        }
        constructFrom patches;
        patches ( "patch_2_.*" );
    }

    {
        name defaultFaces;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_0_.*" );
    }


);


// ************************************************************************* //
