dependencies/hisa/examples/aerodynamicHeating/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000.0;

boundaryField
{

    symmetry
    {
        type        empty;
    }

    farField
    {
        type        characteristicFarfieldPressure;
        U           ( 1000.0 0.0 0.0 );
        p           100000.0;
        T           293.0;
        value       $internalField;
    }

    fluidToSolid
    {
        type        characteristicWallPressure;
        value       $internalField;
    }

    defaultFaces
    {
        type        zeroGradient;
    }

}

// ************************************************************************* //
