dependencies/hisa/examples/aerodynamicHeating/0/fluid/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 57.3;

boundaryField
{

    symmetry
    {
        type        empty;
    }

    farField
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.1;
        value           $internalField;
    }

    fluidToSolid
    {
        type        omegaWallFunction;
        value       $internalField;
    }

    defaultFaces
    {
        type        zeroGradient;
    }

}

// ************************************************************************* //
